app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id", "picture") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["content", "jisnvosvosj"], ["created_at", "2021-10-04 15:44:42.749473"], ["updated_at", "2021-10-04 15:44:42.749473"], ["user_id", 1], ["picture", "mypage.png"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" LIMIT ?  [["LIMIT", 1]]
---
  def index
    @posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    p 'show_start========================='
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "変更"], ["content", "変更"], ["updated_at", "2021-10-04 14:33:19.780748"], ["id", 4]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 9]]
---
  def destroy
    p 'des_start========================='
    @post = Post.find_by(id: params[:id])
    @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
---
    def correct_user
      @post = current_user.posts.find_by(id: params[:id])