app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)

  def show
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @users = User.all.order(id: :asc)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

  def edit
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(current_user.id)
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "okok@ne.jp"], ["password_digest", "$2a$10$I0hnncv28SrbHiS2qGVfTOvi/Ak50ez8AA9nlBAVMz4.iTnL2KH/C"], ["updated_at", "2021-10-05 10:25:41.454178"], ["id", 1]]

    def correct_user
      @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]